Repository: xcv58/MacTools
Catalog: Plugins/SavedScripts/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: ar, de, en, es, fr, ja, ko, pt, ru, tr, zh_hant

# action.confirm.button
source: 运行
ar: تشغيل
de: Ausführen
en: Run
es: Ejecutar
fr: Exécuter
ja: 実行
ko: 실행
pt: Executar
ru: Запустить
tr: Çalıştır
zh_hant: 執行

# action.confirm.message
source: 脚本将以你的用户权限运行，并可访问你的文件和应用。
ar: يعمل البرنامج النصي بصلاحيات المستخدم الخاصة بك وقد يصل إلى ملفاتك وتطبيقاتك.
de: Das Skript wird mit deinen Benutzerrechten ausgeführt und kann auf deine Dateien und Apps zugreifen.
en: The script runs with your user permissions and may access your files and applications.
es: El script se ejecuta con tus permisos de usuario y puede acceder a tus archivos y aplicaciones.
fr: Le script s’exécute avec vos autorisations utilisateur et peut accéder à vos fichiers et applications.
ja: スクリプトはユーザ権限で実行され、ファイルやアプリにアクセスする場合があります。
ko: 스크립트는 사용자 권한으로 실행되며 파일과 앱에 접근할 수 있습니다.
pt: O script é executado com suas permissões de usuário e pode acessar seus arquivos e aplicativos.
ru: Скрипт выполняется с вашими правами пользователя и может получать доступ к файлам и приложениям.
tr: Betik, kullanıcı izinlerinizle çalışır; dosyalarınıza ve uygulamalarınıza erişebilir.
zh_hant: 腳本將以你的使用者權限執行，並可存取你的檔案和 App。

# action.confirm.title.format
source: 运行“%@”？
ar: تشغيل «%@»؟
de: „%@“ ausführen?
en: Run “%@”?
es: ¿Ejecutar «%@»?
fr: Exécuter « %@ » ?
ja: 「%@」を実行しますか？
ko: ‘%@’을(를) 실행할까요?
pt: Executar “%@”?
ru: Запустить «%@»?
tr: “%@” çalıştırılsın mı?
zh_hant: 執行「%@」？

# action.description.format
source: 运行已存的 %@ 脚本。
ar: تشغيل برنامج %@ النصي المحفوظ.
de: Führt das gespeicherte %@-Skript aus.
en: Run the saved %@ script.
es: Ejecuta el script %@ guardado.
fr: Exécute le script %@ enregistré.
ja: 保存済みの %@ スクリプトを実行します。
ko: 저장된 %@ 스크립트를 실행합니다.
pt: Executa o script %@ salvo.
ru: Запускает сохранённый скрипт %@.
tr: Kayıtlı %@ betiğini çalıştırır.
zh_hant: 執行已儲存的 %@ 腳本。

# action.unavailable.interpreter
source: 脚本解释器不可用。
ar: مفسّر البرنامج النصي غير متاح.
de: Der Skriptinterpreter ist nicht verfügbar.
en: The script interpreter is unavailable.
es: El intérprete del script no está disponible.
fr: L’interpréteur du script est indisponible.
ja: スクリプトのインタプリタを利用できません。
ko: 스크립트 인터프리터를 사용할 수 없습니다.
pt: O interpretador do script não está disponível.
ru: Интерпретатор скрипта недоступен.
tr: Betik yorumlayıcısı kullanılamıyor.
zh_hant: 腳本解譯器無法使用。

# action.unavailable.missing
source: 找不到已存脚本。
ar: تعذّر العثور على البرنامج النصي المحفوظ.
de: Das gespeicherte Skript wurde nicht gefunden.
en: The saved script could not be found.
es: No se encontró el script guardado.
fr: Le script enregistré est introuvable.
ja: 保存済みスクリプトが見つかりません。
ko: 저장된 스크립트를 찾을 수 없습니다.
pt: O script salvo não foi encontrado.
ru: Сохранённый скрипт не найден.
tr: Kayıtlı betik bulunamadı.
zh_hant: 找不到已儲存的腳本。

# action.unavailable.running
source: 脚本正在运行。
ar: البرنامج النصي قيد التشغيل بالفعل.
de: Das Skript wird bereits ausgeführt.
en: The script is already running.
es: El script ya se está ejecutando.
fr: Le script est déjà en cours d’exécution.
ja: スクリプトはすでに実行中です。
ko: 스크립트가 이미 실행 중입니다.
pt: O script já está em execução.
ru: Скрипт уже выполняется.
tr: Betik zaten çalışıyor.
zh_hant: 腳本正在執行。

# action.unavailable.workingDirectory
source: 工作目录不存在。
ar: مجلد العمل غير موجود.
de: Der Arbeitsordner ist nicht vorhanden.
en: The working directory does not exist.
es: La carpeta de trabajo no existe.
fr: Le dossier de travail n’existe pas.
ja: 作業フォルダが存在しません。
ko: 작업 폴더가 존재하지 않습니다.
pt: A pasta de trabalho não existe.
ru: Рабочая папка не существует.
tr: Çalışma dizini yok.
zh_hant: 工作目錄不存在。

# common.add
source: 添加
ar: إضافة
de: Hinzufügen
en: Add
es: Añadir
fr: Ajouter
ja: 追加
ko: 추가
pt: Adicionar
ru: Добавить
tr: Ekle
zh_hant: 加入

# common.cancel
source: 取消
ar: إلغاء
de: Abbrechen
en: Cancel
es: Cancelar
fr: Annuler
ja: キャンセル
ko: 취소
pt: Cancelar
ru: Отмена
tr: İptal

# common.delete
source: 删除
ar: حذف
de: Löschen
en: Delete
es: Eliminar
fr: Supprimer
ja: 削除
ko: 삭제
pt: Apagar
ru: Удалить
tr: Sil
zh_hant: 刪除

# common.duplicate
source: 制作副本
ar: تكرار
de: Duplizieren
en: Duplicate
es: Duplicar
fr: Dupliquer
ja: 複製
ko: 복제
pt: Duplicar
ru: Дублировать
tr: Çoğalt
zh_hant: 製作副本

# common.edit
source: 编辑
ar: تحرير
de: Bearbeiten
en: Edit
es: Editar
fr: Modifier
ja: 編集
ko: 편집
pt: Editar
ru: Изменить
tr: Düzenle
zh_hant: 編輯

# common.more
source: 更多
ar: المزيد
de: Mehr
en: More
es: Más
fr: Plus
ja: その他
ko: 더 보기
pt: Mais
ru: Ещё
tr: Daha Fazla

# common.run
source: 运行
ar: تشغيل
de: Ausführen
en: Run
es: Ejecutar
fr: Exécuter
ja: 実行
ko: 실행
pt: Executar
ru: Запустить
tr: Çalıştır
zh_hant: 執行

# common.save
source: 保存
ar: حفظ
de: Sichern
en: Save
es: Guardar
fr: Enregistrer
ko: 저장
pt: Salvar
ru: Сохранить
tr: Kaydet
zh_hant: 儲存

# common.stop
source: 停止
ar: إيقاف
de: Stoppen
en: Stop
es: Detener
fr: Arrêter
ko: 중지
pt: Parar
ru: Остановить
tr: Durdur

# editor.add.title
source: 添加脚本
ar: إضافة برنامج نصي
de: Skript hinzufügen
en: Add Script
es: Añadir script
fr: Ajouter un script
ja: スクリプトを追加
ko: 스크립트 추가
pt: Adicionar script
ru: Добавить скрипт
tr: Betik Ekle
zh_hant: 加入腳本

# editor.backup.description
source: 脚本可能包含敏感信息，因此默认不备份。工作目录不会写入备份。
ar: قد تحتوي البرامج النصية على معلومات حساسة، ولذلك تُستبعد افتراضيًا. لا يتم تضمين مجلدات العمل مطلقًا.
de: Skripte können vertrauliche Informationen enthalten und werden daher standardmäßig ausgeschlossen. Arbeitsordner werden nie einbezogen.
en: Scripts may contain sensitive information, so they are excluded by default. Working directories are never included.
es: Los scripts pueden contener información confidencial, por lo que se excluyen de forma predeterminada. Las carpetas de trabajo nunca se incluyen.
fr: Les scripts peuvent contenir des informations sensibles et sont donc exclus par défaut. Les dossiers de travail ne sont jamais inclus.
ja: スクリプトには機密情報が含まれる可能性があるため、デフォルトでは除外されます。作業フォルダは含まれません。
ko: 스크립트에 민감한 정보가 포함될 수 있으므로 기본적으로 제외됩니다. 작업 폴더는 포함되지 않습니다.
pt: Scripts podem conter informações confidenciais e, por isso, são excluídos por padrão. Pastas de trabalho nunca são incluídas.
ru: Скрипты могут содержать конфиденциальные данные, поэтому по умолчанию исключены. Рабочие папки никогда не включаются.
tr: Betikler hassas bilgiler içerebileceği için varsayılan olarak yedeklere dahil edilmez. Çalışma dizinleri hiçbir zaman dahil edilmez.
zh_hant: 腳本可能包含敏感資訊，因此預設不備份。工作目錄不會寫入備份。

# editor.backup.title
source: 在 MacTools 备份中包含脚本文本
ar: تضمين مصدر البرنامج النصي في نسخ MacTools الاحتياطية
de: Skripttext in MacTools-Backups einbeziehen
en: Include script source in MacTools backups
es: Incluir el código del script en las copias de MacTools
fr: Inclure le code du script dans les sauvegardes MacTools
ja: MacTools バックアップにスクリプト本文を含める
ko: MacTools 백업에 스크립트 소스 포함
pt: Incluir o código do script nos backups do MacTools
ru: Включать исходный код скрипта в резервные копии MacTools
tr: Betik kaynağını MacTools yedeklerine dahil et
zh_hant: 在 MacTools 備份中包含腳本文字

# editor.confirm.title
source: 从其他入口运行前要求确认
ar: طلب التأكيد خارج البرامج النصية المحفوظة
de: Außerhalb von „Gespeicherte Skripte“ Bestätigung verlangen
en: Require confirmation outside Saved Scripts
es: Pedir confirmación fuera de Scripts guardados
fr: Exiger une confirmation hors de Scripts enregistrés
ja: 保存済みスクリプト以外からの実行時に確認
ko: 저장된 스크립트 밖에서 실행할 때 확인
pt: Exigir confirmação fora de Scripts salvos
ru: Требовать подтверждение вне Сохранённых скриптов
tr: Kayıtlı Betikler dışında onay iste
zh_hant: 從其他入口執行前要求確認

# editor.directory.placeholder
source: 工作目录（可选，例如 ~/Projects）
ar: مجلد العمل (اختياري، مثل ~/Projects)
de: Arbeitsordner (optional, z. B. ~/Projects)
en: Working Directory (Optional, for example ~/Projects)
es: Carpeta de trabajo (opcional, por ejemplo ~/Projects)
fr: Dossier de travail (facultatif, par exemple ~/Projects)
ja: 作業フォルダ（任意、例：~/Projects）
ko: 작업 폴더(선택 사항, 예: ~/Projects)
pt: Pasta de trabalho (opcional, por exemplo ~/Projects)
ru: Рабочая папка (необязательно, например ~/Projects)
tr: Çalışma Dizini (İsteğe bağlı, örneğin ~/Projects)
zh_hant: 工作目錄（可選，例如 ~/Projects）

# editor.edit.title
source: 编辑脚本
ar: تحرير البرنامج النصي
de: Skript bearbeiten
en: Edit Script
es: Editar script
fr: Modifier le script
ja: スクリプトを編集
ko: 스크립트 편집
pt: Editar script
ru: Изменить скрипт
tr: Betik Düzenle
zh_hant: 編輯腳本

# editor.execution.title
source: 运行选项
ar: خيارات التشغيل
de: Ausführungsoptionen
en: Run Options
es: Opciones de ejecución
fr: Options d’exécution
ja: 実行オプション
ko: 실행 옵션
pt: Opções de execução
ru: Параметры запуска
tr: Çalıştırma Seçenekleri
zh_hant: 執行選項

# editor.identity.title
source: 基本信息
ar: عام
de: Allgemein
en: General
es: General
fr: Général
ja: 一般
ko: 일반
pt: Geral
ru: Основные
tr: Genel
zh_hant: 基本資訊

# editor.kind.title
source: 类型
ar: النوع
de: Typ
en: Type
es: Tipo
fr: Type
ja: 種類
ko: 유형
pt: Tipo
ru: Тип
tr: Tür
zh_hant: 類型

# editor.name.placeholder
source: 脚本名称
ar: اسم البرنامج النصي
de: Skriptname
en: Script Name
es: Nombre del script
fr: Nom du script
ja: スクリプト名
ko: 스크립트 이름
pt: Nome do script
ru: Имя скрипта
tr: Betik Adı
zh_hant: 腳本名稱

# editor.runLink.description
source: Run Link 始终显示确认；关闭时，快捷键、手势、操作网格和工作流仍可使用此脚本。
ar: تطلب Run Links التأكيد دائمًا. يمكن للاختصارات والإيماءات وشبكة الإجراءات ومهام سير العمل استخدام هذا البرنامج النصي حتى عند إيقاف Run Links.
de: Run Links verlangen immer eine Bestätigung. Kurzbefehle, Gesten, das Aktionsraster und Workflows können dieses Skript auch bei deaktivierten Run Links verwenden.
en: Run Links always ask for confirmation. Shortcuts, gestures, Action Grid, and workflows can still use this script when Run Links are off.
es: Los Run Links siempre piden confirmación. Los atajos, gestos, la Cuadrícula de acciones y los flujos de trabajo pueden usar este script aunque los Run Links estén desactivados.
fr: Les Run Links demandent toujours une confirmation. Les raccourcis, gestes, la Grille d’actions et les workflows peuvent utiliser ce script même si les Run Links sont désactivés.
ja: Run Link は常に確認を求めます。Run Link がオフでも、ショートカット、ジェスチャ、アクショングリッド、ワークフローからこのスクリプトを使用できます。
ko: Run Link는 항상 확인을 요청합니다. Run Link가 꺼져 있어도 단축키, 제스처, 동작 그리드 및 워크플로에서 이 스크립트를 사용할 수 있습니다.
pt: Run Links sempre pedem confirmação. Atalhos, gestos, a Grade de ações e fluxos de trabalho ainda podem usar este script quando os Run Links estão desativados.
ru: Run Links всегда запрашивают подтверждение. Сочетания клавиш, жесты, Сетка действий и процессы могут использовать этот скрипт и при выключенных Run Links.
tr: Run Link'ler her zaman onay ister. Run Link'ler kapalıyken kısayollar, hareketler, Eylem Izgarası ve iş akışları bu betiği yine kullanabilir.
zh_hant: Run Link 一律顯示確認；關閉時，快速鍵、手勢、操作網格和工作流程仍可使用此腳本。

# editor.runLink.title
source: 允许 Run Link
ar: السماح بـ Run Links
de: Run Links erlauben
en: Allow Run Links
es: Permitir Run Links
fr: Autoriser les Run Links
ja: Run Link を許可
ko: Run Link 허용
pt: Permitir Run Links
ru: Разрешить Run Links
tr: Run Link'lere İzin Ver
zh_hant: 允許 Run Link

# editor.saveAndRun
source: 保存并运行
ar: حفظ وتشغيل
de: Sichern & ausführen
en: Save & Run
es: Guardar y ejecutar
fr: Enregistrer et exécuter
ja: 保存して実行
ko: 저장 및 실행
pt: Salvar e executar
ru: Сохранить и запустить
tr: Kaydet ve Çalıştır
zh_hant: 儲存並執行

# editor.sharing.title
source: 其他入口
ar: نقاط تشغيل أخرى
de: Andere Einstiegspunkte
en: Other Entry Points
es: Otros puntos de entrada
fr: Autres points d’entrée
ja: その他の実行方法
ko: 다른 실행 경로
pt: Outros pontos de entrada
ru: Другие способы запуска
tr: Diğer Giriş Noktaları

# editor.source.title
source: 脚本文本
ar: مصدر البرنامج النصي
de: Skripttext
en: Script Source
es: Código del script
fr: Code du script
ja: スクリプト本文
ko: 스크립트 소스
pt: Código do script
ru: Исходный код
tr: Betik Kaynağı
zh_hant: 腳本文字

# editor.timeout.title
source: 超时
ar: المهلة
de: Zeitlimit
en: Timeout
es: Tiempo límite
fr: Délai
ja: タイムアウト
ko: 시간 제한
pt: Tempo limite
ru: Тайм-аут
tr: Zaman Aşımı
zh_hant: 逾時

# editor.timeout.unit.short
source: 秒
ar: ث
de: Sek.
en: sec
es: s
fr: s
ko: 초
pt: s
ru: с
tr: sn

# editor.timeout.value.format
source: %d 秒
ar: %d ث
de: %d Sek.
en: %d sec
es: %d s
fr: %d s
ko: %d초
pt: %d s
ru: %d с
tr: %d sn

# metadata.description
source: 保存并运行 AppleScript 和 Shell 脚本
ar: حفظ وتشغيل برامج AppleScript وبرامج shell النصية
de: AppleScript- und Shell-Skripte sichern und ausführen
en: Save and run AppleScript and shell scripts
es: Guarda y ejecuta scripts de AppleScript y shell
fr: Enregistrez et exécutez des scripts AppleScript et shell
ja: AppleScript とシェルスクリプトを保存して実行
ko: AppleScript 및 셸 스크립트를 저장하고 실행
pt: Salve e execute scripts AppleScript e shell
ru: Сохраняйте и запускайте скрипты AppleScript и shell
tr: AppleScript ve Shell betiklerini kaydedin ve çalıştırın
zh_hant: 儲存並執行 AppleScript 和 Shell 腳本

# metadata.title
source: 已存脚本
ar: البرامج النصية المحفوظة
de: Gespeicherte Skripte
en: Saved Scripts
es: Scripts guardados
fr: Scripts enregistrés
ja: 保存済みスクリプト
ko: 저장된 스크립트
pt: Scripts salvos
ru: Сохранённые скрипты
tr: Kayıtlı Betikler
zh_hant: 已儲存腳本

# panel.action.openManager
source: 管理脚本…
ar: إدارة البرامج النصية…
de: Skripte verwalten…
en: Manage Scripts…
es: Gestionar scripts…
fr: Gérer les scripts…
ja: スクリプトを管理…
ko: 스크립트 관리…
pt: Gerenciar scripts…
ru: Управление скриптами…
tr: Betikleri Yönet…
zh_hant: 管理腳本…

# panel.action.running.format
source: 正在运行“%@”…
ar: جارٍ تشغيل «%@»…
de: „%@“ wird ausgeführt…
en: Running “%@”…
es: Ejecutando «%@»…
fr: Exécution de « %@ »…
ja: 「%@」を実行中…
ko: ‘%@’ 실행 중…
pt: Executando “%@”…
ru: Выполняется «%@»…
tr: “%@” çalıştırılıyor…
zh_hant: 正在執行「%@」…

# panel.subtitle.count.format
source: %d 个已存脚本
ar: %d من البرامج النصية المحفوظة
de: %d gespeicherte Skripte
en: %d saved scripts
es: %d scripts guardados
fr: %d scripts enregistrés
ja: %d 個の保存済みスクリプト
ko: 저장된 스크립트 %d개
pt: %d scripts salvos
ru: Сохранённых скриптов: %d
tr: %d kayıtlı betik
zh_hant: %d 個已儲存腳本

# panel.subtitle.running.format
source: 正在运行：%@
ar: قيد التشغيل: %@
de: Wird ausgeführt: %@
en: Running: %@
es: Ejecutando: %@
fr: En cours : %@
ja: 実行中：%@
ko: 실행 중: %@
pt: Executando: %@
ru: Выполняется: %@
tr: Çalışıyor: %@
zh_hant: 正在執行：%@

# run.error.cancelled
source: 脚本已取消。
ar: تم إلغاء البرنامج النصي.
de: Das Skript wurde abgebrochen.
en: The script was cancelled.
es: El script se canceló.
fr: Le script a été annulé.
ja: スクリプトはキャンセルされました。
ko: 스크립트가 취소되었습니다.
pt: O script foi cancelado.
ru: Скрипт отменён.
tr: Betik iptal edildi.
zh_hant: 腳本已取消。

# run.error.exitCode.format
source: 脚本退出，状态码 %d。
ar: انتهى البرنامج النصي بالحالة %d.
de: Das Skript wurde mit Status %d beendet.
en: The script exited with status %d.
es: El script terminó con el estado %d.
fr: Le script s’est terminé avec l’état %d.
ja: スクリプトはステータス %d で終了しました。
ko: 스크립트가 상태 %d(으)로 종료되었습니다.
pt: O script terminou com o status %d.
ru: Скрипт завершился со статусом %d.
tr: Betik, %d durum koduyla sonlandı.
zh_hant: 腳本結束，狀態碼 %d。

# run.error.interpreter
source: 脚本解释器不可用。
ar: مفسّر البرنامج النصي غير متاح.
de: Der Skriptinterpreter ist nicht verfügbar.
en: The script interpreter is unavailable.
es: El intérprete del script no está disponible.
fr: L’interpréteur du script est indisponible.
ja: スクリプトのインタプリタを利用できません。
ko: 스크립트 인터프리터를 사용할 수 없습니다.
pt: O interpretador do script não está disponível.
ru: Интерпретатор скрипта недоступен.
tr: Betik yorumlayıcısı kullanılamıyor.
zh_hant: 腳本解譯器無法使用。

# run.error.timeout.format
source: 脚本运行超过 %d 秒，已停止。
ar: تجاوز البرنامج النصي %d ثانية وتم إيقافه.
de: Das Skript hat %d Sekunden überschritten und wurde gestoppt.
en: The script exceeded %d seconds and was stopped.
es: El script superó %d segundos y se detuvo.
fr: Le script a dépassé %d secondes et a été arrêté.
ja: スクリプトが %d 秒を超えたため停止しました。
ko: 스크립트가 %d초를 초과하여 중지되었습니다.
pt: O script excedeu %d segundos e foi interrompido.
ru: Скрипт превысил %d секунд и был остановлен.
tr: Betik %d saniyeyi aştığı için durduruldu.
zh_hant: 腳本執行超過 %d 秒，已停止。

# run.error.workingDirectory
source: 工作目录不存在。
ar: مجلد العمل غير موجود.
de: Der Arbeitsordner ist nicht vorhanden.
en: The working directory does not exist.
es: La carpeta de trabajo no existe.
fr: Le dossier de travail n’existe pas.
ja: 作業フォルダが存在しません。
ko: 작업 폴더가 존재하지 않습니다.
pt: A pasta de trabalho não existe.
ru: Рабочая папка не существует.
tr: Çalışma dizini yok.
zh_hant: 工作目錄不存在。

# run.status.cancelled
source: 已取消
ar: ملغى
de: Abgebrochen
en: Cancelled
es: Cancelado
fr: Annulé
ja: キャンセル済み
ko: 취소됨
pt: Cancelado
ru: Отменено
tr: İptal Edildi

# run.status.failed
source: 失败
ar: فشل
de: Fehlgeschlagen
en: Failed
es: Error
fr: Échec
ja: 失敗
ko: 실패
pt: Falhou
ru: Сбой
tr: Başarısız
zh_hant: 失敗

# run.status.running
source: 运行中
ar: قيد التشغيل
de: Wird ausgeführt
en: Running
es: En ejecución
fr: En cours
ja: 実行中
ko: 실행 중
pt: Em execução
ru: Выполняется
tr: Çalışıyor
zh_hant: 執行中

# run.status.succeeded
source: 已完成
ar: مكتمل
de: Abgeschlossen
en: Completed
es: Completado
fr: Terminé
ja: 完了
ko: 완료됨
pt: Concluído
ru: Завершено
tr: Tamamlandı

# settings.copy.suffix
source: 副本
ar: نسخة
de: Kopie
en: Copy
es: Copia
fr: Copie
ja: コピー
ko: 복사본
pt: Cópia
ru: Копия
tr: Kopya

# settings.delete.message
source: 使用此脚本的快捷键、手势、操作网格和工作流将变为不可用。
ar: ستصبح الاختصارات والإيماءات وخلايا شبكة الإجراءات ومهام سير العمل التي تستخدم هذا البرنامج النصي غير متاحة.
de: Kurzbefehle, Gesten, Aktionsraster-Felder und Workflows, die dieses Skript verwenden, sind anschließend nicht mehr verfügbar.
en: Shortcuts, gestures, Action Grid cells, and workflows that use this script will become unavailable.
es: Los atajos, gestos, celdas de la Cuadrícula de acciones y flujos de trabajo que usan este script dejarán de estar disponibles.
fr: Les raccourcis, gestes, cellules de la Grille d’actions et workflows utilisant ce script deviendront indisponibles.
ja: このスクリプトを使用するショートカット、ジェスチャ、アクショングリッドのセル、ワークフローは利用できなくなります。
ko: 이 스크립트를 사용하는 단축키, 제스처, 동작 그리드 셀 및 워크플로를 사용할 수 없게 됩니다.
pt: Atalhos, gestos, células da Grade de ações e fluxos de trabalho que usam este script ficarão indisponíveis.
ru: Сочетания клавиш, жесты, ячейки Сетки действий и процессы, использующие этот скрипт, станут недоступны.
tr: Bu betiği kullanan kısayollar, hareketler, Eylem Izgarası hücreleri ve iş akışları kullanılamaz hale gelir.
zh_hant: 使用此腳本的快速鍵、手勢、操作網格和工作流程將無法使用。

# settings.delete.title
source: 删除脚本？
ar: حذف البرنامج النصي؟
de: Skript löschen?
en: Delete Script?
es: ¿Eliminar script?
fr: Supprimer le script ?
ja: スクリプトを削除しますか？
ko: 스크립트를 삭제할까요?
pt: Apagar script?
ru: Удалить скрипт?
tr: Betik Silinsin Mı?
zh_hant: 刪除腳本？

# settings.empty.action
source: 添加第一个脚本
ar: إضافة أول برنامج نصي
de: Erstes Skript hinzufügen
en: Add First Script
es: Añadir el primer script
fr: Ajouter le premier script
ja: 最初のスクリプトを追加
ko: 첫 스크립트 추가
pt: Adicionar o primeiro script
ru: Добавить первый скрипт
tr: İlk Betiği Ekle
zh_hant: 加入第一個腳本

# settings.empty.description
source: 添加 AppleScript 或 Shell 脚本，然后直接运行或在 MacTools 的其他操作入口中使用。
ar: أضف برنامج AppleScript أو برنامج shell نصيًا، ثم شغّله هنا أو من أي واجهة إجراءات في MacTools.
de: Füge ein AppleScript- oder Shell-Skript hinzu und führe es hier oder über eine beliebige MacTools-Aktionsoberfläche aus.
en: Add an AppleScript or shell script, then run it here or use it from any MacTools action surface.
es: Añade un script de AppleScript o shell y ejecútalo aquí o desde cualquier superficie de acciones de MacTools.
fr: Ajoutez un script AppleScript ou shell, puis exécutez-le ici ou depuis toute surface d’action MacTools.
ja: AppleScript またはシェルスクリプトを追加し、ここや MacTools の任意のアクション画面から実行できます。
ko: AppleScript 또는 셸 스크립트를 추가한 다음 여기나 MacTools의 모든 동작 화면에서 실행하세요.
pt: Adicione um script AppleScript ou shell e execute-o aqui ou em qualquer superfície de ações do MacTools.
ru: Добавьте скрипт AppleScript или shell, затем запустите его здесь или с любой поверхности действий MacTools.
tr: Bir AppleScript veya Shell betiği ekleyin; ardından buradan çalıştırın ya da MacTools'un herhangi bir eylem yüzeyinden kullanın.
zh_hant: 加入 AppleScript 或 Shell 腳本，然後直接執行或在 MacTools 的其他操作入口中使用。

# settings.empty.title
source: 没有已存脚本
ar: لا توجد برامج نصية محفوظة
de: Keine gespeicherten Skripte
en: No Saved Scripts
es: No hay scripts guardados
fr: Aucun script enregistré
ja: 保存済みスクリプトなし
ko: 저장된 스크립트 없음
pt: Nenhum script salvo
ru: Нет сохранённых скриптов
tr: Kayıtlı Betik Yok
zh_hant: 沒有已儲存腳本

# settings.library.invalid
source: 无法读取脚本库；原始数据已保留。
ar: تعذّرت قراءة مكتبة البرامج النصية؛ تم الاحتفاظ ببياناتها الأصلية.
de: Die Skriptbibliothek konnte nicht gelesen werden; die Originaldaten wurden beibehalten.
en: The script library could not be read; its original data was preserved.
es: No se pudo leer la biblioteca de scripts; se conservaron sus datos originales.
fr: La bibliothèque de scripts n’a pas pu être lue ; ses données d’origine ont été conservées.
ja: スクリプトライブラリを読み込めませんでした。元のデータは保持されています。
ko: 스크립트 보관함을 읽을 수 없습니다. 원본 데이터는 보존되었습니다.
pt: Não foi possível ler a biblioteca de scripts; os dados originais foram preservados.
ru: Не удалось прочитать библиотеку скриптов; исходные данные сохранены.
tr: Betik kitaplığı okunamadı; özgün veriler korundu.
zh_hant: 無法讀取腳本庫；原始資料已保留。

# settings.library.title
source: 脚本库
ar: مكتبة البرامج النصية
de: Skriptbibliothek
en: Script Library
es: Biblioteca de scripts
fr: Bibliothèque de scripts
ja: スクリプトライブラリ
ko: 스크립트 보관함
pt: Biblioteca de scripts
ru: Библиотека скриптов
tr: Betik Kitaplığı
zh_hant: 腳本庫

# settings.output.empty
source: 脚本没有产生输出。
ar: لم يُنتج البرنامج النصي أي مخرجات.
de: Das Skript hat keine Ausgabe erzeugt.
en: The script produced no output.
es: El script no generó ninguna salida.
fr: Le script n’a produit aucune sortie.
ja: スクリプトから出力はありませんでした。
ko: 스크립트에서 출력이 생성되지 않았습니다.
pt: O script não produziu saída.
ru: Скрипт не вывел данных.
tr: Betik çıktı üretmedi.
zh_hant: 腳本沒有產生輸出。

# settings.output.running
source: 脚本正在运行…
ar: البرنامج النصي قيد التشغيل…
de: Das Skript wird ausgeführt…
en: The script is running…
es: El script se está ejecutando…
fr: Le script est en cours d’exécution…
ja: スクリプトを実行中…
ko: 스크립트 실행 중…
pt: O script está em execução…
ru: Скрипт выполняется…
tr: Betik çalışıyor…
zh_hant: 腳本正在執行…

# settings.output.show
source: 查看输出
ar: إظهار المخرجات
de: Ausgabe anzeigen
en: Show Output
es: Mostrar salida
fr: Afficher la sortie
ja: 出力を表示
ko: 출력 보기
pt: Mostrar saída
ru: Показать вывод
tr: Çıktıyı Göster
zh_hant: 檢視輸出

# settings.output.stderr
source: 错误输出
ar: الخطأ القياسي
de: Standardfehler
en: Standard Error
es: Error estándar
fr: Erreur standard
ja: 標準エラー
ko: 표준 오류
pt: Erro padrão
ru: Стандартная ошибка
tr: Standart Hata
zh_hant: 錯誤輸出

# settings.output.stdout
source: 标准输出
ar: المخرجات القياسية
de: Standardausgabe
en: Standard Output
es: Salida estándar
fr: Sortie standard
ja: 標準出力
ko: 표준 출력
pt: Saída padrão
ru: Стандартный вывод
tr: Standart Çıktı
zh_hant: 標準輸出

# settings.output.title
source: 最近输出
ar: المخرجات الأخيرة
de: Letzte Ausgabe
en: Recent Output
es: Salida reciente
fr: Sortie récente
ja: 最近の出力
ko: 최근 출력
pt: Saída recente
ru: Последний вывод
tr: Son Çıktılar
zh_hant: 最近輸出

# settings.output.truncated
source: 输出过长，只显示前 64 KB。
ar: كانت المخرجات طويلة؛ يتم عرض أول 64 كيلوبايت فقط.
de: Die Ausgabe war lang; nur die ersten 64 KB werden angezeigt.
en: Output was long; only the first 64 KB is shown.
es: La salida era larga; solo se muestran los primeros 64 KB.
fr: La sortie était longue ; seuls les premiers 64 Ko sont affichés.
ja: 出力が長いため、先頭の 64 KB のみ表示します。
ko: 출력이 길어 처음 64KB만 표시합니다.
pt: A saída era longa; apenas os primeiros 64 KB são exibidos.
ru: Вывод слишком длинный; показаны только первые 64 КБ.
tr: Çıktı uzundu; yalnızca ilk 64 KB gösteriliyor.
zh_hant: 輸出過長，只顯示前 64 KB。
